{
  "jokes": {
    "BBQ_DAD": [
      "Why did the barbecue chef get a promotion? Because he was really on a roll!",
      "What's a grill master's favorite type of music? Heavy metal and blues!",
      "Why do dads love propane? Because it's the only gas that doesn't talk back!",
      "I told my wife she was drawing her eyebrows too high. She looked surprised.",
      "Why did the chicken cross the road? To escape my grill!",
      "What do you call a fake noodle? An impasta. But on my grill? Dinner!",
      "I'm on a seafood diet. I see food and I grill it.",
      "Why don't oysters donate to charity? Because they're shellfish. Just like my teenagers!",
      "What's the difference between a grill and a conversation with my teenager? One gets hot, the other stays cold.",
      "I used to be a vegetarian, but I saw the light and medium-rare at the same time."
    ],
    "FIX_IT_DAD": [
      "I told my wife I'd fix the leaky faucet tomorrow. That's Dad language for 'never'.",
      "Why did the handyman carry a ladder? Because he heard the drinks were on the house!",
      "I've got a screw loose. But don't worry, I'll fix it... eventually.",
      "What's a handyman's favorite game? Hide and go seek the missing tools!",
      "Why did the hammer go to therapy? It hit the nail on the head too many times.",
      "I asked my wife if I could fix her broken watch. She said 'time will tell'.",
      "Why don't I trust stairs? Because they're always up to something. Unlike my toolbox.",
      "I'd tell you a joke about construction, but I'm still working on it.",
      "What did the electrician say to the capacitor? 'I'm shocked we met this way!'",
      "I'm great at fixing things. Especially things that aren't broken yet."
    ],
    "GOLF_DAD": [
      "Golf is like taxes... you drive hard to get to the green, and end up in the hole.",
      "Why do golfers carry two pairs of pants? In case they get a hole in one!",
      "I'd tell you a golf joke, but I don't want to drive you crazy.",
      "What's a golfer's favorite letter? Tee!",
      "Why did the golfer bring an extra pair of socks? In case he got a hole in one!",
      "Golf is the only sport where you can yell 'Fore!' shoot 6, and write down 5.",
      "I play golf because it's the only sport where you can drink and drive.",
      "Why was the golf course so hot? Because all the fans had left!",
      "What do you call a wizard on a golf course? Harry Putter!",
      "My golf game is like a fine wine... it gets worse with age."
    ],
    "COUCH_DAD": [
      "I told my wife I was watching a documentary about how sofas are made. She said 'stop making things up'!",
      "Why did the remote control go to school? To get smarter clicks!",
      "I've finally achieved my goal: I can reach the remote without getting up. Success!",
      "What's a couch potato's favorite TV show? Game of Thrones (because they have the Iron Throne, I have the La-Z-Boy)!",
      "Why don't I exercise? Because I think my refrigerator hates when I'm not home.",
      "I told my doctor I broke my arm in two places. He told me to stop going to those places. Now I just watch TV.",
      "What's the difference between a dad and a remote? Dads can't change channels as fast!",
      "I've watched so much TV, I now speak in commercials. 'But wait, there's more!'",
      "Why did the TV go to the doctor? It had a broken screen and needed a remote possibility of a cure!",
      "My favorite exercise is a cross between a lunge and a crunch... I call it lunch."
    ],
    "LAWN_DAD": [
      "I told my grass a joke. It didn't laugh... it was too emo to be mowed.",
      "Why was the lawn so embarrassed? It saw the gardener's edging!",
      "I love my lawn mower. It's the only thing that actually listens to me.",
      "What's a gardener's favorite type of music? Rock and mulch!",
      "Why did the tomato turn red? Because it saw the salad dressing! Also, I ran it over with the mower.",
      "I asked my lawn if it needed a haircut. It didn't say anything, but it was clearly looking a bit shaggy.",
      "Why do dads love raking leaves? It's the only time their kids actually help them clean up.",
      "What's the difference between a dad and a lawn? The lawn gets mowed once a week!",
      "I told my wife I was going to fertilize the lawn. She said 'grow up'!",
      "Why did the gardener quit his job? Because the turnover was too high!"
    ],
    "CAR_DAD": [
      "I told my car a joke. It didn't laugh... it just stalled and needed a jump!",
      "Why did the mechanic sleep under the car? To wake up oily!",
      "I love working on cars. It's the only time I can tell my wife 'this will take all weekend' and be right.",
      "What's a car's favorite meal? Brake-fast!",
      "Why don't I trust my car? Because it's always breaking down on me. Literally.",
      "I asked my mechanic if he could fix my car. He said 'I can't make promises, but I can make parts'.",
      "What's the difference between a dad and a mechanic? Mechanics actually fix things!",
      "I told my wife I needed to change the oil. She said 'you mean you need to change your shirt'!",
      "Why did the car get a flat tire? Because it was tired of my driving!",
      "I've got a pickup truck. It's great for picking up my kids from practice... eventually."
    ],
    "OFFICE_DAD": [
      "I told my boss I wanted a raise. He said 'you can't raise the dead!'",
      "Why did the office worker bring a ladder to work? He heard the corporate ladder was there!",
      "I love meetings. They're the only place where I can say nothing for an hour and call it 'participating'.",
      "What's an office worker's favorite type of paper? Spread-sheets!",
      "Why did the stapler go to therapy? It felt under pressure!",
      "I asked my coworkers if they wanted to hear a joke about paper. They said 'no, it's too tearable'!",
      "What's the difference between a dad and a desk? Desks don't pretend to work!",
      "I told my boss I needed a day off for 'personal reasons'. He said 'you mean napping'!",
      "Why did the office worker get fired? He kept checking his emails when he was supposed to be working!",
      "I've got a great job security. Nobody else wants it!"
    ],
    "COOL_DAD": [
      "I told my kids I'm cool. They said 'you're not cool, you're just room temperature'!",
      "Why did the cool dad wear sunglasses? Because his future was too bright... and his kids told him to!",
      "I'm not a regular dad, I'm a cool dad. That's what my kids call me when they want money.",
      "What's a cool dad's favorite music? Dad rock! (But cool dad rock... like Nickelback).",
      "Why did the cool dad get a tattoo? To show his kids he's still hip to the groove!",
      "I tried to teach my kids about TikTok. They told me to stick to Facebook.",
      "What's the difference between a cool dad and a regular dad? Cool dads use slang incorrectly!",
      "I told my kids I was down with the kids. They said 'you're not down, you're just tired'!",
      "Why did the cool dad buy a skateboard? To break his hip in style!",
      "I'm so cool, I wear my baseball hat backwards. My wife says I look like I'm trying too hard."
    ],
    "COACH_DAD": [
      "I told my team 'winning isn't everything'. Then I proceeded to scream when they lost!",
      "Why did the coach go to the bank? To get his quarterback!",
      "I love coaching youth sports. It's the only time I can yell at other people's kids and get away with it.",
      "What's a coach's favorite type of sandwich? A sub-stitute!",
      "Why did the football coach go to the office? To get his quarterback (quarter-back)!",
      "I told my players 'give 110%'. Math teacher said that's impossible. I said 'that's why I'm the coach!'",
      "What's the difference between a coach and a dad? Coaches have timeouts, dads just have regrets!",
      "I asked my players if they wanted to hear a joke about defense. They said 'no, we've heard enough excuses'!",
      "Why did the coach bring a ladder to the game? He wanted to help his team reach the next level!",
      "I'm not just a coach, I'm a mentor. That means I yell at you because I care!"
    ],
    "CHEF_DAD": [
      "I told my wife I'm the chef of the house. She said 'you burn water, so no'!",
      "Why did the chef quit his job? He couldn't take the heat in the kitchen... or the criticism!",
      "I love cooking on the grill. It's the only time I can burn dinner and call it 'smoky flavor'!",
      "What's a chef's favorite type of movie? The Hunger Games... because I'm always hungry when I cook!",
      "Why did the tomato turn red? Because it saw the salad dressing! Also, I was chasing it with a knife!",
      "I asked my wife if she wanted me to cook dinner. She said 'only if you want food poisoning'!",
      "What's the difference between a dad and a chef? Cheefs can actually follow a recipe!",
      "I tried to make homemade pasta. It came out as 'homemade sauce with crunchy noodles'!",
      "Why did the chef go to the doctor? He had a bad case of grill-itis!",
      "I'm a great cook. My specialty is ordering takeout and pretending I made it!"
    ],
    "HOLIDAY_DAD": [
      "I told my kids I saw Santa. They said 'you were drunk again, weren't you'!",
      "Why did the Christmas tree go to the dentist? It needed a root canal... or to get its lights checked!",
      "I love Christmas. It's the only time I can wear ugly sweaters and call it 'fashion'!",
      "What's Santa's favorite type of music? Wrap music!",
      "Why did the turkey cross the road? To prove it wasn't chicken! Also, to escape Thanksgiving!",
      "I told my family I'm the Christmas gift. They said 'you're a gift alright... a gift that keeps on taking'!",
      "What's the difference between a dad and a Christmas tree? The tree looks better decorated!",
      "I asked my wife what she wanted for Christmas. She said 'a new husband'. I said 'I can't afford that'!",
      "Why did the Easter egg hide? It was a little chicken!",
      "I'm so festive, I start playing Christmas music in November. My family hates me!"
    ],
    "WAREHOUSE_DAD": [
      "I told my boss I'd organize the warehouse. He said 'you mean make a bigger mess'!",
      "Why did the forklift go to therapy? It had lifting issues!",
      "I love working in the warehouse. It's the only place where I can lose things and blame it on 'inventory'!",
      "What's a warehouse worker's favorite game? Hide and seek the inventory!",
      "Why did the box get promoted? It was outstanding in its field!",
      "I asked my coworker if he could help me find something. He said 'only if you can find it yourself'!",
      "What's the difference between a warehouse dad and a regular dad? Warehouse dads have more boxes to carry!",
      "I told my wife I was working late at the warehouse. She said 'you mean you're taking a nap in the breakroom'!",
      "Why did the pallet go to the doctor? It had a fork-lift injury!",
      "I'm great at inventory. I can lose track of anything in seconds!"
    ],
    "VINTAGE_DAD": [
      "I told my kids about the good old days. They said 'you mean when you had to walk uphill both ways'!",
      "Why did the vintage dad keep his old tools? Because they don't make 'em like they used to... thank goodness!",
      "I love my vintage car. It breaks down constantly, but it has 'character'!",
      "What's a vintage dad's favorite technology? Anything that requires a manual!",
      "Why did the vintage dad refuse to use a smartphone? He said 'if it ain't broke, don't fix it... but this IS broke!'",
      "I asked my kids if they wanted to see my vintage collection. They said 'you mean your junk pile'!",
      "What's the difference between a vintage dad and a regular dad? Vintage dads have more stories about walking to school!",
      "I told my wife I needed to fix my vintage radio. She said 'just buy a new one like a normal person'!",
      "Why did the vintage dad love his flip phone? Because it was the only thing that flipped off his kids!",
      "I'm so vintage, I still have a VCR. I've got the time displayed as 12:00 for 20 years!"
    ],
    "FASHION_DAD": [
      "I told my wife I have great fashion sense. She said 'socks with sandals says otherwise'!",
      "Why did the fashion dad wear white after Labor Day? Because he's a rebel... or just clueless!",
      "I love my socks and sandals combo. It's breathable, it's practical, and it embarrasses my teenagers!",
      "What's a fashion dad's favorite accessory? The fanny pack... worn on the front for maximum efficiency!",
      "Why did the fashion dad buy cargo shorts? To carry more snacks!",
      "I asked my kids if my outfit looked good. They said 'you're wearing it, so no'!",
      "What's the difference between a fashion dad and a regular dad? Fashion dads think Crocs are high fashion!",
      "I told my wife I need new clothes. She said 'for what, the backyard BBQ'!",
      "Why did the fashion dad wear a belt? To hold up his pants... and his dignity!",
      "I'm so stylish, I wear the same Hawaiian shirt to every event. It's my signature look!"
    ],
    "TECH_DAD": [
      "I told my kids I'm tech-savvy. They said 'you still double-click on touchscreens'!",
      "Why did the tech dad get a virus? He opened an email from a 'Nigerian prince' who promised him a better relationship with his kids!",
      "I love my computer. It's the only thing that listens to me... when I type!",
      "What's a tech dad's favorite programming language? DAD (Dads Always Debugging)!",
      "Why did the tech dad restart his computer? Because that's how he solves all of life's problems!",
      "I asked my son to help me with the WiFi. He said 'did you try turning it off and on again?' I said 'I invented that!'",
      "What's the difference between a tech dad and a regular dad? Tech dads have stronger passwords for their email than for the WiFi!",
      "I told my wife I need to upgrade my phone. She said 'you only use it for calls and Candy Crush'!",
      "Why did the tech dad love his smart home? Because he could finally control the thermostat without getting up!",
      "I'm so tech-savvy, I still have a landline. Just in case!"
    ]
  }
}
